requireiot/MyVoiceBox/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"

#
# Bootloader config
#

#
# Log
#
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
# end of Log
# end of Bootloader config

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
# end of Partition Table

#
# Arduino Configuration
#
CONFIG_AUTOSTART_ARDUINO=y

#
# Debug Log Configuration
#
CONFIG_ARDUHAL_LOG_DEFAULT_LEVEL_INFO=y
# end of Debug Log Configuration
# end of Arduino Configuration

#
# ESP Speech Recognition
#
CONFIG_SR_NSN_NSNET2=y

#
# Load Multiple Wake Words (WakeNet9)
#
CONFIG_SR_WN_WN9_ALEXA=y
# end of Load Multiple Wake Words (WakeNet9)

CONFIG_SR_MN_EN_MULTINET7_QUANT=y
# end of ESP Speech Recognition

#
# ESP RainMaker Config
#
CONFIG_ESP_RMAKER_MQTT_HOST="mqtt.rainmaker.espressif.com"
# end of ESP RainMaker Config

#
# Component config
#

#
# ESP-Driver:I2S Configurations
#
CONFIG_I2S_ISR_IRAM_SAFE=y
# end of ESP-Driver:I2S Configurations

#
# Power Management
#
CONFIG_PM_SLEEP_FUNC_IN_IRAM=y
# end of Power Management

#
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# SPI RAM config
#
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
# end of SPI RAM config
# end of ESP PSRAM

#
# ESP System Settings
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

#
# Cache config
#
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
# end of Cache config

CONFIG_ESP_INT_WDT_TIMEOUT_MS=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
# end of ESP System Settings

#
# ESP Timer (High Resolution Timer)
#
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192
# end of ESP Timer (High Resolution Timer)

#
# Wi-Fi
#
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=6
# end of Wi-Fi

#
# FreeRTOS
#

#
# Kernel
#
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# end of Kernel

#
# Extra
#
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=n
# end of Extra
# end of FreeRTOS

#
# Log
#

#
# Log Level
#
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
# end of Log Level

#
# Format
#
CONFIG_LOG_COLORS=y
# end of Format
# end of Log

#
# LWIP
#
CONFIG_LWIP_IPV6=n
# end of LWIP

#
# mbedTLS
#

#
# TLS Key Exchange Methods
#
CONFIG_MBEDTLS_PSK_MODES=y
CONFIG_MBEDTLS_KEY_EXCHANGE_PSK=y
# end of TLS Key Exchange Methods
# end of mbedTLS

#
# ESP-MQTT Configurations
#
CONFIG_MQTT_TRANSPORT_SSL=n
CONFIG_MQTT_TRANSPORT_WEBSOCKET=n
CONFIG_MQTT_TASK_CORE_SELECTION_ENABLED=y
CONFIG_MQTT_USE_CORE_1=y
# end of ESP-MQTT Configurations

#
# Modbus configuration
#
CONFIG_FMB_COMM_MODE_TCP_EN=n
CONFIG_FMB_MASTER_TIMEOUT_MS_RESPOND=5000
CONFIG_FMB_QUEUE_LENGTH=50
# end of Modbus configuration

#
# Audio Codec Device Configuration
#
CONFIG_CODEC_TAS5805M_SUPPORT=n
CONFIG_CODEC_DUMMY_SUPPORT=y
# end of Audio Codec Device Configuration

#
# ESP RainMaker Common
#
CONFIG_ESP_RMAKER_WORK_QUEUE_TASK_STACK=5120
# end of ESP RainMaker Common

#
# LVGL configuration
#
CONFIG_LV_CONF_SKIP=n

#
# HAL Settings
#
CONFIG_LV_DEF_REFR_PERIOD=1000
# end of HAL Settings

#
# Rendering Configuration
#
CONFIG_LV_DRAW_SW_SUPPORT_XRGB8888=n
CONFIG_LV_DRAW_SW_SUPPORT_ARGB8888=n
CONFIG_LV_DRAW_SW_SUPPORT_ARGB8888_PREMULTIPLIED=n
CONFIG_LV_DRAW_SW_SUPPORT_L8=n
CONFIG_LV_DRAW_SW_SUPPORT_AL88=n
CONFIG_LV_DRAW_SW_SUPPORT_A8=n
CONFIG_LV_DRAW_SW_SUPPORT_I1=n
CONFIG_LV_DRAW_SW_COMPLEX=n
# end of Rendering Configuration

#
# Widget Usage
#
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_ARC=n
CONFIG_LV_USE_ARCLABEL=n
CONFIG_LV_USE_BAR=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_CHECKBOX=n
CONFIG_LV_USE_DROPDOWN=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_LABEL_TEXT_SELECTION=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_ROLLER=n
CONFIG_LV_USE_SCALE=n
CONFIG_LV_USE_SLIDER=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_SPINNER=n
CONFIG_LV_USE_SWITCH=n
CONFIG_LV_USE_TABLE=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n
# end of Widget Usage

#
# Examples
#
CONFIG_LV_BUILD_EXAMPLES=n
# end of Examples

#
# Demos
#
CONFIG_LV_BUILD_DEMOS=n
# end of Demos
# end of LVGL configuration
# end of Component config
